In [8]:
import pandas as pd
import numpy as np
x = pd.read_csv('titanic.csv')
x.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

Доля выживших мужчин и женщин от общего количества мужчин/женщин

In [4]:
num_male = len(x[x.Sex == "male"])
num_female = len(x[x.Sex == "female"])
num_male_survived = len(x[(x.Sex == "male") & x.Survived == 1])
num_female_survived = len((x[(x.Sex == "female") & x.Survived == 1]))
print("For man: " + str(num_male_survived/num_male))
print("For woman: " + str(num_female_survived/num_female))

For man: 0.19022687609075042
For woman: 0.7420382165605095

In [5]:
x.groupby('Sex')[['Survived']].mean()

        Survived
Sex
female  0.742038
male    0.190227

Найти из какого класса доля выживших мужчин/женщин наиболее высокая

In [6]:
x.pivot_table('Survived', index='Sex', columns='Pclass')

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.137026

Какой средний/минимальный возраст выживших/умерших на Титанике

In [9]:
x.pivot_table('Age', index='Survived', aggfunc=[np.mean, np.min])

               mean  amin
                Age   Age
Survived
0         30.138532  1.00
1         28.408392  0.42

Подсчитать долю выживших среди тех, у кого было несколько кают.

In [1]:
import numpy as np
import pandas as pd
y = pd.read_csv('train.csv')
y.head()

cabins=[]
sur_cabins=[]

#f_sur = y[(y.Survived == 1)]

for i in range(y.Name.count()):
    cab_str=str(y.loc[i,'Cabin'])
    words=cab_str.split(' ')
    if (len(words) > 1):
        cabins.append(words)
        if (int(y.loc[i,'Survived'] == 1)):
            sur_cabins.append(words)
print("доля выживших среди тех, у кого было несколько кают")
print(float(len(sur_cabins)/len(cabins)) * 100)

доля выживших среди тех, у кого было несколько кают
58.333333333333336

Найти выжившую девушку в возрасте от 18 до 25 (включительно) у которой был самый дешевый билет.

In [11]:
female_survived = x[(x.Sex == "female") & (x.Survived == 1) & (x.Age >= 18) & (x.Age <= 25)]
female_survived_cheapest = female_survived[female_survived.Fare == female_survived.Fare.min()]
print(female_survived_cheapest)

    Survived  Pclass                    Name     Sex   Age  \
19         1       3  Mrs. Fatima Masselmani  female  22.0

    Siblings/Spouses Aboard  Parents/Children Aboard   Fare
19                        0                        0  7.225